Repository: foolery33/SuperFit
Catalog: SuperFit-Lab2/Resources/Localization/MainScreen/*.lproj/MainScreenStrings.strings
Languages: ru

source: Push-Ups
ru: Отжимания

# push_ups_description
source: Push-ups exercise the pectoral muscles, triceps, and anterior deltoids.
ru: Отжимания тренируют грудные мышцы, трицепсы и передние дельтоиды.

source: Plank
ru: Планка

# plank_description
source: The plank strengthens the abdominals, back and shoulders.
ru: Планка укрепляет мышцы живота, спины и плеч.

source: Squats
ru: Приседания

# squats_description
source: Ð¡onsidered a vital exercise for increasing the strength and size of the lower body.
ru: Считается жизненно важным упражнением для увеличения силы и размера нижней части тела.

source: Crunch
ru: Пресс

# crunch_description
source: It involves the entire abs, but primarily it works the rectus abdominis muscle.
ru: Задействует весь пресс, но в первую очередь работает прямая мышца живота.

source: Running
ru: Бег

# running_description
source: It develops endurance, strengthens the legs and the cardiovascular system.
ru: Бег развивает выносливость, укрепляет ноги и сердечно-сосудистую систему.

source: My body
ru: Моё тело

source: Last exercises
ru: Последние упражнения

source: Details
ru: Детали

source: Sign Out
ru: Выйти

source: See all
ru: Посмотреть все
