Repository: foolery33/SuperFit
Catalog: SuperFit-Lab2/Resources/Localization/Errors/*.lproj/Errors.strings
Languages: ru

# invalid_credentials
source: Either your email or password are incorrect. Please try again
ru: Либо ваш email, либо пароль неверны. Пожалуйста, попробуйте еще раз

# server_error
source: Some server error occured. Please try again later
ru: Произошла ошибка сервера. Пожалуйста, повторите попытку позже

# model_error
source: Internal application error. Please contact developer
ru: Внутренняя ошибка приложения. Пожалуйста, свяжитесь с разработчиком

# empty_username
source: Please enter username to continue
ru: Пожалуйста, введите имя пользователя, чтобы продолжить

# empty_email
source: Please enter e-mail to continue
ru: Пожалуйста, введите e-mail, чтобы продолжить

# empty_code
source: Please enter code to continue
ru: Пожалуйста, введите пароль, чтобы продолжить

# empty_repeat_code
source: Please confirm code to continue
ru: Пожалуйста, введите код ещё раз, чтобы продолжить

# invalid_email
source: Your email does not conform to default email pattern
ru: Ваш E-mail не соответствует стандартному шаблону электронной почты

# different_codes
source: You've provided different codes. Make sure they are equal
ru: Вы указали разные коды. Убедитесь, что они одинаковы

# invalid_code
source: The code should not contain zero
ru: Слишком слабый код, введите другую комбинацию

# unauthorized
source: Your authentication token is expired. Please login again
ru: Срок действия вашего авторизационного токена истек. Пожалуйста, войдите в систему снова

# problem_with_executing
source: Some problem occured while executing the request. Try again later
ru: При выполнении запроса возникла проблема. Повторите попытку позже

# photo_not_found
source: An image with provided id was not found. Please contact developer
ru: Изображение с предоставленным id не было найдено. Пожалуйста, свяжитесь с разработчиком

source: Updating body parameter error
ru: Ошибка при обновалении параметров тела

source: Body parameters loading error
ru: Ошибка при загрузке параметров тела

source: Profile photos loading error
ru: Ошибка при загрузке фотографий профиля

# token_expired
source: Token is expired
ru: Время жизни токена истекло

source: Error
ru: Ошибка

# empty_weight
source: Enter weight information to save it on a server
ru: Введите данные о весе, чтобы сохранить информацию на сервере

# empty_height
source: Enter height information to save it on a server
ru: Введите данные о росте, чтобы сохранить информацию на сервере

# height_validation_error
source: Height should be a number from 10 to 300
ru: Рост должен быть числом от 10 до 300

# weight_validation_error
source: Weight should be a number from 10 to 300
ru: Вес должен быть числом от 10 до 300

# avatar_setting_error
source: Avatar setting failed
ru: Ошибка установки аватара

# corrupted_file
source: Your file is corrupted
ru: Ваш файл повреждён
